// Title: Windows EventLog Autologger Session Registry Modification Via CommandLine
// Author: Swachchhanda Shrawan Poudel (Nextron Systems)
// Date: 2025-12-25
// Level: high
// Description: Detects attempts to disable Windows EventLog autologger sessions via registry modification.
// The AutoLogger event tracing session records events that occur early in the operating system boot process.
// Applications and device drivers can use the AutoLogger session to capture traces before the user logs in.
// Adversaries may disable these sessions to evade detection and prevent security monitoring of early boot activities and system events.
// MITRE Tactic: Uncategorized
// Tags: attack.defense-impairment, attack.t1685.001
// Reference: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_autologger_session_registry_modification.yml

DeviceProcessEvents
| where (ProcessCommandLine contains "add " or ProcessCommandLine contains "Set-ItemProperty" or ProcessCommandLine contains "New-ItemProperty" or ProcessCommandLine contains "si ") and ProcessCommandLine contains "\\Control\\WMI\\Autologger\\" and (ProcessCommandLine contains "Start" or ProcessCommandLine contains "Enabled") and ((FolderPath endswith "\\reg.exe" or FolderPath endswith "\\powershell.exe" or FolderPath endswith "\\pwsh.exe") or (ProcessVersionInfoOriginalFileName in~ ("reg.exe", "PowerShell.EXE", "pwsh.dll")))